// 진구는 친구들과 제로섬 게임을 하려고 한다.
// 제로섬 게임은 주어진 숫자들을 모아, 더 적은 갯수의 숫자로 모든 숫자를 더해 `0`으로 만들면 이기는 게임이다.
// 진구는 친구들이 찾은 답이 최적의 답인지 검증하기 위해, 몇 개의 정수를 더해야 하는지 구하는 프로그램을 만들고자 한다.
// `N`개의 서로 다른 정수로 이루어진 배열 `arr`이 주어졌을 때, 이 중에 총 합을 `0`으로 만들 수 있는 최소의 숫자의 개수를 찾는 함수를 구현하시오.

// ## 입력 설명
// - `0 < N <= 1000`
// - `-1000 <= arr[i] <= 1000`

// ## 출력 설명
// 총 합을 `0`으로 만드는 최소의 정수 개수
// 단, 답이 `5`보다 크거나 없는 경우 `-1`을 반환

// ## 입력 예시
// `N = 5`
// `arr = [-5, -2, 4, 5, 7]`

// ## 출력 예시
// `2`

// ## 입출력 예시 설명
// `-5`와 `5` 총 `2`개를 선택하면 합이 0이 된다.
